{
  "heroes": [
    {
      "name": "Gall",
      "counters": [
        {
          "name": "Greymane"
        },
        {
          "name": "Kharazim"
        },
        {
          "name": "Leoric"
        },
        {
          "name": "Raynor"
        }
      ],
      "reason": "Cho'gall's nature makes him particularly vulnerable to most forms of crowd control and percent-based damage sources. Fortunately, Cho'gall has plenty of Talent choices and maneuvers that allow him to adapt to a variety of less-than-ideal situations."
    },
    {
      "name": "Junkrat",
      "counters": [
        {
          "name": "Illidan"
        },
        {
          "name": "Sonya"
        },
        {
          "name": "Zeratul"
        },
        {
          "name": "Tyrael"
        }
      ],
      "reason": "Junkrat is countered by highly mobile Heroes who can easily dive him in the backline. Beyond  Concussion Mine Junkrat has no immediate source of peel, therefore he is particularly susceptible to Heroes that can stick to him with some form of gap-closer. The fact that all of Junkrat's abilities are skillshots also makes it particularly difficult to combat highly mobile enemy Heroes."
    },
    {
      "name": "Illidan",
      "counters": [
        {
          "name": "Arthas"
        },
        {
          "name": "Brightwing"
        },
        {
          "name": "E.T.C."
        },
        {
          "name": "Li Li"
        },
        {
          "name": "Muradin"
        },
        {
          "name": "Sonya"
        },
        {
          "name": "Uther"
        }
      ],
      "reason": "Illidan's reliance on the healing and Cooldown reduction provided by  Betrayer's Thirst makes him particularly vulnerable to effects that can reduce his attack speed or otherwise stop him from attacking. Furthermore, his ability to split push can often be matched by other Heroes to even out any advantage generated by this strategy. Although Illidan can be countered by many Heroes, his design makes him very oppressive when poorly counterpicked."
    },
    {
      "name": "Greymane",
      "counters": [
        {
          "name": "Brightwing"
        },
        {
          "name": "Johanna"
        },
        {
          "name": "Muradin"
        },
        {
          "name": "Xul"
        }
      ],
      "reason": "As a melee Assassin with a rather telegraphed play style, Greymane is very vulnerable to any form of targeted crowd control. Given that his Basic Attacks are his main source of damage, he is also greatly hindered by any form of debuff that might blind him or reduce his Attack speed."
    },
    {
      "name": "Kael'thas",
      "counters": [
        {
          "name": "Illidan"
        },
        {
          "name": "Zeratul"
        },
        {
          "name": "Kerrigan"
        },
        {
          "name": "Tracer"
        }
      ],
      "reason": "Kael'thas is countered by highly mobile assassins who are able to dive him behind the allied frontline. He will need to rely heavily on the assistance of his team to survive once engaged on by means of peel or damage mitigation abilities."
    },
    {
      "name": "Lunara",
      "counters": [
        {
          "name": "Illidan"
        },
        {
          "name": "Kharazim"
        },
        {
          "name": "Raynor"
        },
        {
          "name": "The Butcher"
        }
      ]
    },
    {
      "name": "Stitches",
      "counters": [
        {
          "name": "Leoric"
        },
        {
          "name": "Anub'arak"
        },
        {
          "name": "D.Va"
        },
        {
          "name": "Murky"
        }
      ],
      "reason": "Because so much of Stitches' ability to impact a match is baked into Hook, he can be challenged by frontline Heroes who are bad Hook targets. This typically means that these Heroes can easily escape once pulled by Hook, that killing them is of little consequence, or both. These Heroes can stand in front of their team, making it much harder to land Hook on more meaningful backline enemies."
    },
    {
      "name": "Rexxar",
      "counters": [
        {
          "name": "Kael'thas"
        },
        {
          "name": "Tychus"
        },
        {
          "name": "Artanis"
        }
      ],
      "reason": "Rexxar does not need to fear many Heroes, as he is an excellent laner and a solid team fighter during most periods of the game. However, there are some opponents he should pay special attention to. Kael'thas and Tychus, in particular, can abuse Misha's reckless positioning quite heavily by either shredding her health with  Minigun or causing her to spread  Living Bomb onto nearby allies. Being one of the strongest duelists in the game, Artanis is one of the few Heroes who can hold his own against Rexxar in a one-on-one lane."
    },
    {
      "name": "The Butcher",
      "counters": [
        {
          "name": "Johanna"
        },
        {
          "name": "Zeratul"
        },
        {
          "name": "Brightwing"
        },
        {
          "name": "Uther"
        }
      ],
      "reason": "The Butcher's \"all-in\" play style tends to suffer against Heroes who are able to completely shut down his damage output through mitigation or hard crowd-control. Blinds, Silences, Stuns, and Invulnerability work well to keep The Butcher at bay."
    },
    {
      "name": "Zarya",
      "counters": [
        {
          "name": "Alarak"
        },
        {
          "name": "Illidan"
        },
        {
          "name": "Sylvanas"
        },
        {
          "name": "Jaina"
        }
      ],
      "reason": "Zarya is countered by Heroes who are able to outmaneuver and silence her like Illidan, Alarak, or Sylvanas. Furthermore, team compositions that feature Zarya oftentimes struggle when it comes to clearing bigger Minion and Mercenary waves, which is another reason why Sylvanas is hard to deal with. It is extremely important to time  Personal Barrier and  Shield Ally well in order to quickly charge your Energy level when facing those types of Heroes. Besides, try not to wander off too far from the rest of your allies or else you may not be able to escape an enemy gank in time."
    },
    {
      "name": "Murky",
      "counters": [
        {
          "name": "Li-Ming"
        },
        {
          "name": "Tychus"
        },
        {
          "name": "Zarya"
        }
      ],
      "reason": "Murky's predictable attack plan and his dependency on remaining within close range of his targets to effectively deal damage make him vulnerable to most high damage Hero with some way of kiting him or quickly destroying  Pufferfish. Li-Ming is a notorious Murky counter due to the way her  Critical Mass Trait functions. At Hero Level 16, Zarya gains access to her own form of crowd control removal in the form of  Cleansing Shield, which greatly reduces the effectiveness of  Octo-Grab."
    },
    {
      "name": "Chen",
      "counters": [
        {
          "name": "Anub'arak"
        },
        {
          "name": "Muradin"
        },
        {
          "name": "Johanna"
        },
        {
          "name": "Varian"
        }
      ],
      "reason": "Chen's greatest weakness is any form of crowd control that interrupts his  Fortifying Brew. As such, Stun-heavy Warriors like Muradin or Johanna prove to be quite the challenge. A different kind of threat are Heroes like Varian, who gain access to shield destroying talents, such as  Shattering Throw which greatly reduce Fortifying Brew's protection. "
    },
    {
      "name": "Zagara",
      "counters": [
        {
          "name": "Kerrigan"
        },
        {
          "name": "Alarak"
        },
        {
          "name": "Nova"
        },
        {
          "name": "Zeratul"
        }
      ],
      "reason": "Zagara is counterd by high mobility assassins with large amounts of burst damage. Zagara's lack of a reliable gap-closer may regularly be capitalized on by more agile opponents."
    },
    {
      "name": "Genji",
      "counters": [
        {
          "name": "Varian"
        },
        {
          "name": "Malfurion"
        },
        {
          "name": "Lunara"
        }
      ],
      "reason": "Due to his very low health pool, Genji struggles against Heroes with strong crowd control that render him defenseless for a short period of time. Thus, abilities like Varian's  Taunt or Malfurion's  Twilight Dream can cause great problems for him. Furthermore, nimble ranged Assassins with great kiting potential such as Lunara can bait him into overextending only to get outnumbered by the enemy team.  Keep in mind that any form of poison damage continues to tick after Genji's  Deflect expires, which is another reason why Lunara is a dangerous enemy for him to face."
    },
    {
      "name": "Kerrigan",
      "counters": [
        {
          "name": "Tyrael"
        },
        {
          "name": "Uther"
        },
        {
          "name": "Medivh"
        },
        {
          "name": "Auriel"
        }
      ]
    },
    {
      "name": "Malthael",
      "counters": [
        {
          "name": "Falstad"
        },
        {
          "name": "Lunara"
        },
        {
          "name": "Tracer"
        },
        {
          "name": "Valla"
        }
      ],
      "reason": "As a melee Assassin with a rather telegraphed play style, Malthael is very vulnerable to any form of targeted crowd control. Furthermore, since his main gap closer,  Wraith Strike, requires him to either attack or hit a slow skillshot, he is naturally bound to be kited by nimble ranged Heroes."
    },
    {
      "name": "Samuro",
      "counters": [
        {
          "name": "Alarak"
        },
        {
          "name": "Kael'thas"
        },
        {
          "name": "Tassadar"
        },
        {
          "name": "Zarya"
        }
      ],
      "reason": "Samuro will have a hard time against Heroes who can reliably reveal Images, or damage all three possible Samuros at the same time. Some Heroes can actually benefit from your Images; either by using them to complete quests easily, or by farming them for unique resources like Energy."
    },
    {
      "name": "Jaina",
      "counters": [
        {
          "name": "Anub'arak"
        },
        {
          "name": "Chen"
        },
        {
          "name": "Genji"
        },
        {
          "name": "Nova"
        },
        {
          "name": "Tracer"
        },
        {
          "name": "Valeera"
        },
        {
          "name": "Zeratul"
        }
      ],
      "reason": "Since Jaina relies chiefly on skillshots and delayed Abilities to deal damage, she does particularly poorly against Heroes that have ways of quickly dodging her Abilities. Furthermore, her frailty and lack of self-peel makes her vulnerable to Cloaked or otherwise high-damage nimble Heroes that can quickly reach her."
    },
    {
      "name": "Ragnaros",
      "counters": [
        {
          "name": "Chen"
        },
        {
          "name": "Lunara"
        },
        {
          "name": "Nova"
        },
        {
          "name": "Tracer"
        }
      ],
      "reason": "As a generalist, Ragnaros is not particularly vulnerable or effective against anyone; still, his lack of crowd control makes him inadequate against some specific Heroes, notably Chen. He is also prone to be kited due to his lack of an effective gap closer."
    },
    {
      "name": "Tracer",
      "counters": [
        {
          "name": "Zul'jin"
        },
        {
          "name": "Varian"
        },
        {
          "name": "Valla"
        }
      ],
      "reason": "Tracer is threatened by Heroes who have Abilities that can target her directly. Her survival depends on mobility; she dies very quickly when she cannot avoid damage. This makes her vulnerable against Heroes with powerful ranged Basic Attacks, and Heroes who can disable her with single target crowd control that prevent Recall from being cast."
    },
    {
      "name": "Raynor",
      "counters": [
        {
          "name": "Arthas"
        },
        {
          "name": "Johanna"
        },
        {
          "name": "Zeratul"
        }
      ]
    },
    {
      "name": "Sgt. Hammer",
      "counters": [
        {
          "name": "Artanis"
        },
        {
          "name": "Chromie"
        },
        {
          "name": "Kel'Thuzad"
        },
        {
          "name": "Li-Ming"
        },
        {
          "name": "Stitches"
        }
      ],
      "reason": "Since Sgt. Hammer needs to stand still to get the most out of her Abilities, she is naturally vulnerable to Heroes that use dangerous skillshots, particularly those that can displace her."
    },
    {
      "name": "Azmodan",
      "counters": [
        {
          "name": "Diablo"
        },
        {
          "name": "Muradin"
        },
        {
          "name": "The Butcher"
        }
      ],
      "reason": "Given his reliance upon channeling, as both  Globe Of Annihilation and  All Shall Burn are put on a full Cooldown after interruption, Azmodan is naturally countered by Heroes that provide reliable means of or stunning or silencing him. His tendency to split push also leaves him vulnerable to aggressive gankers, especially given his large collision that makes him easy to hit and body block."
    },
    {
      "name": "Rehgar",
      "counters": [
        {
          "name": "Muradin"
        },
        {
          "name": "Lunara"
        },
        {
          "name": "Illidan"
        },
        {
          "name": "Varian"
        }
      ],
      "reason": "Due to the fact that Rehgar cannot cast  Ancestral Healing on himself, he has to carefully avoid getting Stunned. Thus, Heroes like Muradin or Varian can be quite a threat. On the other hand, Heroes like Illidan or Lunara are often too sticky for Rehgar's  Ghost Wolf form to escape (unless he went for  Wolf Run at Level 1). "
    },
    {
      "name": "Valla",
      "counters": [
        {
          "name": "Greymane"
        },
        {
          "name": "Illidan"
        },
        {
          "name": "Nova"
        },
        {
          "name": "Valeera"
        },
        {
          "name": "Zeratul"
        }
      ],
      "reason": "As a frail ranged Assassin, Valla tends to naturally struggle against other high damage Assassins who have the ability to effectively gap close past her  Vault's range or otherwise sneak up on her. With little in the way of self-peeling, make sure to stay near your healer when possible against such Heroes, and make no bold attempts at outplaying your opponents."
    },
    {
      "name": "Muradin",
      "counters": [
        {
          "name": "Tychus"
        },
        {
          "name": "Alarak"
        },
        {
          "name": "Jaina"
        },
        {
          "name": "Malthael"
        }
      ],
      "reason": "Muradin is fairly hard to counter, however, there are a few Heroes that can cause him a hard time. First and foremost, Heroes with percentage based damage, such as Tychus' or Malthael can shred Muradin's health very quickly, especially while in  Avatar. Heroes like Jaina or Alarak, on the other hand, can hinder Muradin's movement and deal huge amounts of burst damage. "
    },
    {
      "name": "Auriel",
      "counters": [
        {
          "name": "The Butcher"
        },
        {
          "name": "Tyrande"
        },
        {
          "name": "Kerrigan"
        }
      ],
      "reason": "Auriel is countered by dive compositions that can successfully engage, even with Crystal Aegis in play. The cooldown on  Ray of Heaven prevents it from saving allies from the most aggressive plays, even in cases where  Bestow Hope is able to refill the energy for a second cast immediately."
    },
    {
      "name": "Arthas",
      "counters": [
        {
          "name": "Tychus"
        },
        {
          "name": "Artanis"
        },
        {
          "name": "Gul'dan"
        },
        {
          "name": "Kael'thas"
        }
      ],
      "reason": "Arthas is excellent when it comes to countering Basic Attackers with the exception of Tychus, whose  Minigun ignores Physical Armor. However, Arthas himself struggles against certain mages who deal a large amount of burst damage like Gul'dan or Kael'thas. Those Heroes are normally hard to reach for Arthas and are also capable of killing several Ghouls of his  Army of the Dead Heroic Ability."
    },
    {
      "name": "Varian",
      "counters": [
        {
          "name": "Alarak"
        },
        {
          "name": "Lunara"
        },
        {
          "name": "Muradin"
        },
        {
          "name": "Valla"
        }
      ],
      "reason": "Varian is countered by Heroes like Lunara or Valla, who are able kite him due to their superior mobility or by Heroes like Muradin or Alarak, who can Silence him or slow his Basic Attacks. In order to deal with those types of Heroes, we recommend avoiding head-on battle. Instead, wait for your allies to arrive and take them on together."
    },
    {
      "name": "Ana",
      "counters": [
        {
          "name": "Lúcio"
        },
        {
          "name": "Tassadar"
        },
        {
          "name": "Genji"
        },
        {
          "name": "Varian"
        }
      ],
      "reason": "Ana usually struggles against mobile enemy Assassins and Warriors, such as Genji or Varian. These Heroes can pose a serious threat to Ana, who has no real escape mechanisms. Furthermore, they are more or less \"immune\" to  Biotic Grenade's healing debuff due to abilities that render them Protected. Heroes like Lucio or Tassadar, on the other hand, provide powerful shields that can also completely ignore the negative side effects of Biotic Grenade. "
    },
    {
      "name": "Gul'dan",
      "counters": [
        {
          "name": "Illidan"
        },
        {
          "name": "Greymane"
        },
        {
          "name": "Kerrigan"
        },
        {
          "name": "Tracer"
        }
      ],
      "reason": "Gul'dan's lack of gap-closer causes him to struggle most against highly mobile assassins, primarily those with a reliable form of crowd-control to interupt his channel of  Drain Life."
    },
    {
      "name": "Li Li",
      "counters": [
        {
          "name": "Valeera"
        },
        {
          "name": "Zeratul"
        },
        {
          "name": "Chromie"
        },
        {
          "name": "Raynor"
        }
      ],
      "reason": " Healing Brew is not very effective against Ability based burst damage. Heroes that deal burst damage will force Healing Brew to heal a single ally, while the rest of her team may be suffering. Forcing Li Li to spend her Mana in an inefficient way is a good way to counter her, especially if she is the only healer on her team. Another way to counter her is to be able to consistantly deal damage while outside the range of  Blinding Wind. Li Li is very effective against most Basic Attack Heroes, but Raynor can Basic Attack from a great enough range that she has to frontline in order to Blind him. Her kit is also poorly equiped to Support her team as they defend a  Hyperion push."
    },
    {
      "name": "Stukov",
      "counters": [
        {
          "name": "Anub'arak"
        },
        {
          "name": "Genji"
        },
        {
          "name": "Uther"
        }
      ],
      "reason": "Stukov is countered by high mobility Heroes who can circumvent his zone control. Lacking any form of Cleanse, Heroes with access to multiple crowd control Abilities are also effective against him."
    },
    {
      "name": "Probius",
      "counters": [
        {
          "name": "Kerrigan"
        },
        {
          "name": "Alarak"
        },
        {
          "name": "Zeratul"
        },
        {
          "name": "Tracer"
        }
      ],
      "reason": "Probius is countered by high mobility assassins with large amounts of burst damage and crowd-control. Probius' lack of a gap-closer may regularly be capitalized on by more agile opponents."
    },
    {
      "name": "Dehaka",
      "counters": [
        {
          "name": "Valla"
        },
        {
          "name": "Nazeebo"
        },
        {
          "name": "Zul'jin"
        }
      ],
      "reason": "One of Dehaka's drawbacks is his lack of a gap-closer, which makes him susceptible to kiting from highly mobile ranged damage dealers. Heroes with very high sustained damage can push through his healing to force him to play passively."
    },
    {
      "name": "Diablo",
      "counters": [
        {
          "name": "Leoric"
        },
        {
          "name": "Raynor"
        },
        {
          "name": "Tychus"
        }
      ],
      "reason": "As a tank with a large amount of Health, Diablo is naturally vulnerable to Heroes that deal percent-based damage. His reliance on being able to engage to be impactful also makes him lackluster against some of the more resilient backline Assassins who have tools to avoid or otherwise nullify his  Shadow Charge +  Overpower combo."
    },
    {
      "name": "Artanis",
      "counters": [
        {
          "name": "Muradin"
        },
        {
          "name": "Brightwing"
        },
        {
          "name": "Varian"
        }
      ],
      "reason": "Artanis gets countered by Heroes like Muradin or Brightwing whose Slows, Stuns, and Polymorphs abilities can prevent Artanis from using his Basic Attacks. Varian's Stuns and his Level 16 talent   Shattering Throw, in particular, pose a serious threat to Artanis' shields,  which makes him the ultimate counter."
    },
    {
      "name": "Tychus",
      "counters": [
        {
          "name": "Anub'arak"
        },
        {
          "name": "Rexxar"
        },
        {
          "name": "Lúcio"
        }
      ],
      "reason": "Tychus does exceptionally high sustained damage with high cooldown Abilities. This can be countered by Heroes who can move themselves and their allies out of range of Tychus until his Abilities are on cooldown. Interrupting Tychus from a distance is also a great way to control his damage output. Tychus is also very susceptible to crowd-controls; they can interupt Overkill and eat up Minigun's active duration."
    },
    {
      "name": "Tyrande",
      "counters": [
        {
          "name": "Johanna"
        },
        {
          "name": "Tyrael"
        },
        {
          "name": "Zeratul"
        }
      ],
      "reason": "Tyrande struggles against Heroes like Johanna or Tyrael, whose  Iron Skin or  Sanctification abilities can make them immune to Stuns and other debuffs. Furthermore, burst-heavy melee Assassins like Zeratul can prove to be quite a threat to Tyrande, who lacks any form of innate escape mechanism."
    },
    {
      "name": "Brightwing",
      "counters": [
        {
          "name": "Anub'arak"
        },
        {
          "name": "Varian"
        },
        {
          "name": "Greymane"
        }
      ],
      "reason": "Brightwing gets countered by crowd control heavy Warriors, such as Anub'arak or Varian who can capitalize on the fact that she has virtually no escape mechanisms other than  Blink Heal. Furthermore, explosive burst Assassins like Greymane can cause a lot of problems for her, since most of her support derives from small ticks of healing over time."
    },
    {
      "name": "Tyrael",
      "counters": [
        {
          "name": "Zeratul"
        },
        {
          "name": "Varian"
        },
        {
          "name": "Tychus"
        },
        {
          "name": "Raynor"
        }
      ],
      "reason": "Tyrael, like any Hero with high health pool, struggles against the Tank-shredding qualities of Tychus and Raynor. Besides, Varian's Stuns, Taunts, and his  Shattering Throw completely shuts down the shields of Tyrael's  Righteousness ability."
    },
    {
      "name": "Alexstrasza",
      "counters": [
        {
          "name": "Genji"
        },
        {
          "name": "Tracer"
        },
        {
          "name": "Illidan"
        }
      ],
      "reason": "Alexstrasza struggles against foes with exceptional mobility. These Heroes will have an easy time chasing her down, since she lacks disengage while she is not in her  Dragonqueen form."
    },
    {
      "name": "Abathur",
      "counters": [
        {
          "name": "Dehaka"
        },
        {
          "name": "Falstad"
        },
        {
          "name": "Ragnaros"
        }
      ],
      "reason": "Abathur's Symbiote and Locusts help him to deny the enemy team experience when objectives spawn, when most Heroes will need to vacate lanes in order to rotate. This tactic is directly countered by Heroes who can travel globally, and who waveclear very efficiently. Heroes that match this description usually have high area of effect damage, making them stronger than Abathur in team fights as well."
    },
    {
      "name": "Uther",
      "counters": [
        {
          "name": "Lunara"
        },
        {
          "name": "Nazeebo"
        },
        {
          "name": "Sylvanas"
        },
        {
          "name": "Zagara"
        }
      ],
      "reason": "Although not particularly vulnerable to any specific Hero himself, Uther tends to struggle against sustained damage, particularly over an area of effect, as his healing is powerful, but ultimately inefficient. His sub-par waveclear can also be problematic if your team composition does not make up for this weakness somewhere else."
    },
    {
      "name": "Garrosh",
      "counters": [
        {
          "name": "Tassadar"
        },
        {
          "name": "Malthael"
        },
        {
          "name": "Tychus"
        },
        {
          "name": "Valla"
        }
      ],
      "reason": "Garrosh struggles against ranged Heroes who are able to easily kite him and dodge his  Groundbreaker with some form of gap-closer such as Valla's  Vault or Tychus'  Run and Gun. Often times if Groundbreaker is missed against one of these types of Heroes, Garrosh may consider backing off instead of chasing into them while taking massive amounts of Basic Attack damage."
    },
    {
      "name": "D.Va",
      "counters": [
        {
          "name": "Alarak"
        },
        {
          "name": "Jaina"
        },
        {
          "name": "Zeratul"
        },
        {
          "name": "Valeera"
        }
      ],
      "reason": "D.Va is countered by Heroes who are able to harass her at a distance with poke and reliable crowd-control. Silences and stuns quickly shut down the use of D.Va's  Defense Matrix and can prevent D.Va from having time to summon a new Mech with  Call Mech after it has been destroyed. Assassins with significant burst damage will be able to shut down D.Va immediately after she enters Pilot Mode when she is most vulnerable."
    },
    {
      "name": "Alarak",
      "counters": [
        {
          "name": "Uther"
        },
        {
          "name": "Anub'arak"
        },
        {
          "name": "The Butcher"
        }
      ],
      "reason": "Alarak is countered by Heroes who can close in on him quickly and stun him. This is especially the case when a single Hero is capable of chaining crowd control."
    },
    {
      "name": "Xul",
      "counters": [
        {
          "name": "Gul'dan"
        },
        {
          "name": "Kael'thas"
        },
        {
          "name": "Dehaka"
        }
      ],
      "reason": "Xul's greatest counter proves to be AoE damage and good counter waveclear. Heroes like Gul'dan or Kael'thas can easily destroy his Skeletons and as such cripple his overall combat performance. Strong solo laners with decent waveclear like Dehaka can also become problematic for Xul to handle."
    },
    {
      "name": "Zeratul",
      "counters": [
        {
          "name": "Brightwing"
        },
        {
          "name": "Chen"
        },
        {
          "name": "Tassadar"
        },
        {
          "name": "Uther"
        }
      ],
      "reason": "Zeratul tends to struggle against Heroes with targeted crowd control effects, as they prevent him from exploiting  Blink and generally remaining safe due to his limited Health pool. Shielding effects are also problematic for him, as they are generally high-value and instantaneous, which counters the burst damage upon which he is reliant."
    },
    {
      "name": "Zul'jin",
      "counters": [
        {
          "name": "E.T.C."
        },
        {
          "name": "Dehaka"
        },
        {
          "name": "Diablo"
        },
        {
          "name": "The Butcher"
        },
        {
          "name": "Zeratul"
        }
      ],
      "reason": "Zul'jin is heavily countered by enemy Heroes that can dive him, disable him via stuns or silences, and burst him down, especially before he is able to activate  Taz'dingo!. Heroes with reliable Blinds such as Li Li's  Blinding Wind also severely hinder Zul'jin's effectiveness in battle."
    },
    {
      "name": "Gazlowe",
      "counters": [
        {
          "name": "Greymane"
        },
        {
          "name": "Gul'dan"
        },
        {
          "name": "Kael'thas"
        },
        {
          "name": "Nazeebo"
        },
        {
          "name": "Nova"
        }
      ],
      "reason": "Gazlowe's short-range nature makes him ineffective against anything that can outrange him and his Turrets. Lacking a reliable movement speed reduction effect also makes him prone to being kited."
    },
    {
      "name": "Valeera",
      "counters": [
        {
          "name": "E.T.C."
        },
        {
          "name": "Dehaka"
        },
        {
          "name": "Tassadar"
        },
        {
          "name": "Brightwing"
        }
      ],
      "reason": "Valeera is countered by Heroes who are able to easily break her from Stealth, as this will prevent her from being able to cast any of her opener abilities. She also is very susceptible to crowd-control as her overextended positioning within the enemy backline will often cause her to be quickly taken down once rendered immobile."
    },
    {
      "name": "Anub'arak",
      "counters": [
        {
          "name": "Leoric"
        },
        {
          "name": "Lunara"
        },
        {
          "name": "Tracer"
        },
        {
          "name": "Valla"
        }
      ],
      "reason": "Although very well rounded, Anub'arak may struggle against Heroes that have ways of avoiding his skillshot based Abilities or otherwise kiting him."
    },
    {
      "name": "Lt. Morales",
      "counters": [
        {
          "name": "Alarak"
        },
        {
          "name": "E.T.C."
        },
        {
          "name": "Kerrigan"
        },
        {
          "name": "Zeratul"
        }
      ],
      "reason": "Lt. Morales' greatest counters are Heroes, mostly Warriors and melee Assassins, whose great hard engage causes serious problems for her. Consequently, Heroes with long range crowd control abilities like Alarak or E.T.C. but also stealthy Heroes, such as Zeratul are the ones she has to look out for the most."
    },
    {
      "name": "Falstad",
      "counters": [
        {
          "name": "Greymane"
        },
        {
          "name": "Illidan"
        },
        {
          "name": "Nova"
        },
        {
          "name": "Valeera"
        },
        {
          "name": "Zeratul"
        }
      ],
      "reason": "As a frail ranged Assassin, Falstad tends to naturally struggle against other high damage Assassins who have the ability to effectively gap close past his  Barrel Roll's range or otherwise sneak up on him. With little in the way of self-peeling, see to stay near your healer when possible against such Heroes, and make no bold attempts at outplaying your opponents.  Also consider running a  Lightning Rod-centric build, as such builds tend to do better against the majority of Falstad's counters."
    },
    {
      "name": "Sonya",
      "counters": [
        {
          "name": "Brightwing"
        },
        {
          "name": "E.T.C."
        },
        {
          "name": "Lunara"
        },
        {
          "name": "Muradin"
        },
        {
          "name": "Uther"
        }
      ],
      "reason": "Sonya's reliance upon  Whirlwind to survive in team fights makes her particularly vulnerable to targeted crowd control. Furthermore, her melee nature makes her relatively easy to kite, and especially when  Ancient Spear is on Cooldown."
    },
    {
      "name": "Li-Ming",
      "counters": [
        {
          "name": "Anub'arak"
        },
        {
          "name": "Chen"
        },
        {
          "name": "Samuro"
        },
        {
          "name": "Tracer"
        },
        {
          "name": "Valeera"
        },
        {
          "name": "Zeratul"
        }
      ],
      "reason": "Since Li-Ming relies chiefly on skillshots to deal damage, she does particularly poorly against Heroes that either have ways of quickly dodging her Abilities, or can summon undesirable targets to get in the way. Furthermore, her frailty and lack of self-peel makes her vulnerable to Cloaked or otherwise high-damage nimble Heroes that can quickly reach her."
    },
    {
      "name": "Chromie",
      "counters": [
        {
          "name": "Illidan"
        },
        {
          "name": "Diablo"
        },
        {
          "name": "Stitches"
        },
        {
          "name": "Tracer"
        }
      ],
      "reason": "Chromie struggles against two kinds of Heroes: the ones that are too beefy for her to take down quickly and the ones that are too fast for her to reliably land her Basic Abilities. As such, Heroes like Illidan or Tracer can become quite dangerous. To somewhat balance the odds in your favor against that type of Hero, we thoroughly recommend picking  Bronze Talons at Level 4 to dish out a surprising amount of reliable damage."
    },
    {
      "name": "Kharazim",
      "counters": [
        {
          "name": "Alarak"
        },
        {
          "name": "Muradin"
        },
        {
          "name": "Johanna"
        }
      ]
    },
    {
      "name": "Cho",
      "counters": [
        {
          "name": "Greymane"
        },
        {
          "name": "Kharazim"
        },
        {
          "name": "Leoric"
        },
        {
          "name": "Raynor"
        }
      ],
      "reason": "Cho'gall's nature makes him particularly vulnerable to most forms of crowd control and percent-based damage sources. Fortunately, Cho'gall has plenty of Talent choices and maneuvers that allow him to adapt to a variety of less-than-ideal situations."
    },
    {
      "name": "Johanna",
      "counters": [
        {
          "name": "Varian"
        }
      ],
      "reason": "Johanna is one of the few Heroes in the game that has no natural counters. She cannot be bursted quickly by Assassins, or crowd controlled by Supports or Tanks, due to  Iron Skin. However, this does not mean she is overpowered or always a good pick to have on your team. Johanna is instead countered by playstyle, such as ignoring her in team fights or targeting her while  Iron Skin is on cooldown. Johanna also lacks good mobility and has no gap-closers, meaning that she can be kited very effectively and has difficulty keeping up with dive-heavy allies. The only Hero we would currently consider to be a \"counter\" to Johanna is Varian due to his  Shattering Throw talent at Level 13, which allows him to shatter both Johanna's  Iron Skin and her  Indestructible talent at Level 20."
    },
    {
      "name": "Nazeebo",
      "counters": [
        {
          "name": "Alarak"
        },
        {
          "name": "Tracer"
        },
        {
          "name": "Zarya"
        }
      ],
      "reason": "Nazeebo is countered by high mobility Heroes who can easily able to dodge his abilities,  Zombie Wall in particular. Furthermore, since most of Nazeebo's damage derives from his poison abilities, it allows Zarya to use use her shields very efficiently in order to charge her Energy level."
    },
    {
      "name": "Cassia",
      "counters": [
        {
          "name": "Kael'thas"
        },
        {
          "name": "Gul'dan"
        },
        {
          "name": "Jaina"
        }
      ],
      "reason": "Cassia has no escapes, limited self sustain, and no tools to mitigate spell damage. Powerful backline mages can win trades with her at range, and punish her brutally if she dives in with Fend."
    },
    {
      "name": "Thrall",
      "counters": [
        {
          "name": "Johanna"
        },
        {
          "name": "Falstad"
        },
        {
          "name": "Muradin"
        }
      ],
      "reason": "Thrall is well-rounded combatant, who usually does not get countered very easily. However, there are certain Heroes like Falstad, Johanna, or Muradin, whose great disengage abilities allow them to slow down Thrall's   Earthquake or  Sundering engages."
    },
    {
      "name": "Malfurion",
      "counters": [
        {
          "name": "Jaina"
        },
        {
          "name": "Kerrigan"
        },
        {
          "name": "Li-Ming"
        },
        {
          "name": "Tracer"
        }
      ],
      "reason": "Although not particularly vulnerable to any specific Hero himself, Malfurion tends to struggle against burst damage. His sub-par waveclear can also be problematic if your team composition does not make up for this weakness somewhere else."
    },
    {
      "name": "Tassadar",
      "counters": [
        {
          "name": "Alarak"
        },
        {
          "name": "Varian"
        },
        {
          "name": "Chen"
        }
      ],
      "reason": "Tassadar does not really get countered by a lot of Heroes, however, there are a few that can cause some problems for him. First and foremost, Varian's  Shattering Throw talent allows him to break Tassadar's shields very quickly. Furthermore, Tassadar is susceptible to Silences, which makes Alarak a rather uncomfortable opponent to face."
    },
    {
      "name": "Nova",
      "counters": [
        {
          "name": "Chen"
        },
        {
          "name": "Illidan"
        },
        {
          "name": "Tassadar"
        },
        {
          "name": "Zarya"
        }
      ],
      "reason": "As a ranged Assassin with little in the way of escaping, Nova players must rely on burst damage and long-ranged attacks to perform well. As such, she tends to struggle with anything that has a reliable means of mitigating damage for oneself or for allies or closing the gap to get up close and personal with her."
    },
    {
      "name": "Medivh",
      "counters": [
        {
          "name": "Anub'arak"
        },
        {
          "name": "Sylvanas"
        },
        {
          "name": "Lunara"
        }
      ]
    },
    {
      "name": "Varian",
      "counters": [
        {
          "name": "Alarak"
        },
        {
          "name": "Lunara"
        },
        {
          "name": "Muradin"
        },
        {
          "name": "Valla"
        }
      ],
      "reason": "Varian is countered by Heroes like Lunara or Valla, who are able kite him due to their superior mobility or by Heroes like Muradin or Alarak, who can Silence him or slow his Basic Attacks. In order to deal with those types of Heroes, we recommend avoiding head-on battle. Instead, wait for your allies to arrive and take them on together."
    },
    {
      "name": "Sylvanas",
      "counters": [
        {
          "name": "Chen"
        },
        {
          "name": "Diablo"
        },
        {
          "name": "Nova"
        },
        {
          "name": "Zeratul"
        }
      ],
      "reason": "As a fragile backline Hero, Sylvanas struggles against anything that can either burst her down or match the mobility provided by  Haunting Wave. Cloaked Heroes are particularly threatening to her, as they generally highly limit her ability to safely split push."
    },
    {
      "name": "Leoric",
      "counters": [
        {
          "name": "Illidan"
        },
        {
          "name": "Tracer"
        },
        {
          "name": "Valla"
        }
      ],
      "reason": "Leoric struggles against high-mobility Heroes who can simply outmaneuver him and dodge his  Drain Hope. Those Heroes are usually too far away from Leoric or too elusive to remain caught in his  Entomb as well."
    },
    {
      "name": "The Lost Vikings",
      "counters": [
        {
          "name": "Zeratul"
        },
        {
          "name": "Nova"
        },
        {
          "name": "Kael'thas"
        },
        {
          "name": "Li-Ming"
        }
      ]
    }
  ]
}